benchmark_results/NVIDIA_GB10/vLLM_NVIDIA_GB10_gpt_oss_120b_text_only_20260130_012546.txt
##############################################################
# vLLM TEXT-ONLY BENCHMARK RESULTS
##############################################################

DEVICE INFO
-----------
Device (raw):       NVIDIA GB10
Device (sanitized): NVIDIA_GB10
NVIDIA GB10, [N/A], 580.95.05, 12.1

METADATA
--------
Date:            Fri Jan 30 01:25:46 AM UTC 2026
Hostname:        spark-ff62
Model:           openai/gpt-oss-120b
Test Type:       Text-Only
Num Prompts:     100
Max Concurrency: 10
Num Warmups:     10
Input Length:    1000 (±0.3)
Output Length:   300 (±0.3)
Seed:            42

##############################################################
# TEST RESULTS
##############################################################

============================================================
TEST: Text-Only Benchmark
Started: Fri Jan 30 01:25:46 AM UTC 2026
============================================================

Script started on 2026-01-30 01:25:46+00:00 [COMMAND="docker run -t --rm --network host         nvcr.io/nvidia/vllm:25.12.post1-py3         vllm bench serve         --backend openai-chat         --model "openai/gpt-oss-120b"         --endpoint /v1/chat/completions         --base-url http://localhost:8000         --dataset-name random         --num-prompts 100         --max-concurrency 10         --num-warmups 10         --random-prefix-len 0         --random-input-len 1000         --random-output-len 300         --random-range-ratio 0.3         --request-rate inf         --ignore-eos         --seed 42" TERM="xterm-256color" TTY="/dev/pts/13" COLUMNS="194" LINES="46"]

==========
== vLLM ==
==========

NVIDIA Release 25.12.post1 (build 247811356)
vLLM Version 0.12.0+35a9f223
Container image Copyright (c) 2025, NVIDIA CORPORATION & AFFILIATES. All rights reserved.

Various files include modifications (c) NVIDIA CORPORATION & AFFILIATES.  All rights reserved.

GOVERNING TERMS: The software and materials are governed by the NVIDIA Software License Agreement
(found at https://www.nvidia.com/en-us/agreements/enterprise-software/nvidia-software-license-agreement/)
and the Product-Specific Terms for NVIDIA AI Products
(found at https://www.nvidia.com/en-us/agreements/enterprise-software/product-specific-terms-for-ai-products/).

WARNING: The NVIDIA Driver was not detected.  GPU functionality will not be available.
   Use the NVIDIA Container Toolkit to start this container with GPU support; see
   https://docs.nvidia.com/datacenter/cloud-native/ .

NOTE: The SHMEM allocation limit is set to the default of 64MB.  This may be
   insufficient for vLLM.  NVIDIA recommends the use of the following flags:
   docker run --gpus all --ipc=host --ulimit memlock=-1 --ulimit stack=67108864 ...

/usr/local/lib/python3.12/dist-packages/torchvision/io/image.py:14: UserWarning: Failed to load image Python extension: 'Could not load this library: /usr/local/lib/python3.12/dist-packages/torchvision/image.so'If you don't plan on using image functionality from `torchvision.io`, you can ignore this warning. Otherwise, there might be something wrong with your environment. Did you have `libjpeg` or `libpng` installed before building `torchvision` from source?
  warn(
INFO 01-30 01:25:50 [importing.py:44] Triton is installed but 0 active driver(s) found (expected 1). Disabling Triton to prevent runtime errors.
INFO 01-30 01:25:50 [importing.py:68] Triton not installed or not compatible; certain GPU-related functions will not be available.
WARNING 01-30 01:25:50 [interface.py:221] Failed to import from vllm._C: ImportError('libcuda.so.1: cannot open shared object file: No such file or directory')
INFO 01-30 01:25:51 [main.py:47] Unspecified platform detected, switching to CPU Platform instead.
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0xe6b8a4e20e00>, seed=42, num_prompts=100, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, random_input_len=1000, random_output_len=300, random_range_ratio=0.3, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='openai-chat', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/chat/completions', header=None, max_concurrency=10, model='openai/gpt-oss-120b', tokenizer=None, use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, trust_remote_code=False, disable_tqdm=False, num_warmups=10, profile=False, save_result=False, save_detailed=False, append_result=False, metadata=None, result_dir=None, result_filename=None, ignore_eos=True, percentile_metrics=None, metric_percentiles='99', goodput=None, request_id_prefix='bench-d9cd4248-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, tokenizer_mode='auto', served_model_name=None, lora_modules=None, ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=600, extra_body=None)
tokenizer_config.json: 0.00B [00:00, ?B/s]tokenizer_config.json: 4.20kB [00:00, 23.0MB/s]
tokenizer.json:   0%|                                                                                                                                                 | 0.00/27.9M [00:00<?, ?B/s]tokenizer.json: 100%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 27.9M/27.9M [00:01<00:00, 18.4MB/s]tokenizer.json: 100%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 27.9M/27.9M [00:01<00:00, 18.4MB/s]
special_tokens_map.json:   0%|                                                                                                                                         | 0.00/98.0 [00:00<?, ?B/s]special_tokens_map.json: 100%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 98.0/98.0 [00:00<00:00, 1.26MB/s]
chat_template.jinja: 0.00B [00:00, ?B/s]chat_template.jinja: 16.7kB [00:00, 76.4MB/s]
INFO 01-30 01:25:56 [datasets.py:613] Sampling input_len from [700, 1300] and output_len from [210, 390]
Starting initial single prompt test run...
Waiting for endpoint to become up in 600 seconds
 |                                                                                                                                                                    | 00:00 elapsed, ? remaining |                                                                                                                                                                | 00:00 elapsed, 00:10 remaining |                                                                                                                                                           | 00:04 elapsed, 1727:26:46 remaining
Initial test run completed.
Warming up with 10 requests...
  0%|                                                                                                                                                                      | 0/10 [00:00<?, ?it/s] 10%|███████████████▊                                                                                                                                              | 1/10 [00:08<01:20,  8.91s/it]100%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 10/10 [00:09<00:00,  1.51it/s]100%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 10/10 [00:09<00:00,  1.10it/s]
Warmup run completed.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 10
  0%|                                                                                                                                                                     | 0/100 [00:00<?, ?it/s]  1%|█▌                                                                                                                                                           | 1/100 [00:10<16:36, 10.07s/it]  2%|███▏                                                                                                                                                         | 2/100 [00:11<08:16,  5.07s/it]  3%|████▋                                                                                                                                                        | 3/100 [00:11<04:31,  2.80s/it]  4%|██████▎                                                                                                                                                      | 4/100 [00:12<03:26,  2.15s/it]  5%|███████▊                                                                                                                                                     | 5/100 [00:13<02:40,  1.69s/it]  6%|█████████▍                                                                                                                                                   | 6/100 [00:15<02:29,  1.59s/it]  7%|██████████▉                                                                                                                                                  | 7/100 [00:15<01:42,  1.10s/it]  8%|████████████▌                                                                                                                                                | 8/100 [00:16<01:47,  1.17s/it]  9%|██████████████▏                                                                                                                                              | 9/100 [00:18<02:22,  1.56s/it] 10%|███████████████▌                                                                                                                                            | 10/100 [00:19<01:55,  1.29s/it] 11%|█████████████████▏                                                                                                                                          | 11/100 [00:22<02:40,  1.80s/it] 12%|██████████████████▋                                                                                                                                         | 12/100 [00:24<02:32,  1.73s/it] 13%|████████████████████▎                                                                                                                                       | 13/100 [00:26<02:35,  1.78s/it] 14%|█████████████████████▊                                                                                                                                      | 14/100 [00:27<02:29,  1.74s/it] 15%|███████████████████████▍                                                                                                                                    | 15/100 [00:27<01:46,  1.25s/it] 16%|████████████████████████▉                                                                                                                                   | 16/100 [00:28<01:31,  1.09s/it] 17%|██████████████████████████▌                                                                                                                                 | 17/100 [00:29<01:30,  1.08s/it] 18%|████████████████████████████                                                                                                                                | 18/100 [00:30<01:17,  1.05it/s] 19%|█████████████████████████████▋                                                                                                                              | 19/100 [00:34<02:27,  1.82s/it] 20%|███████████████████████████████▏                                                                                                                            | 20/100 [00:35<02:19,  1.74s/it] 21%|████████████████████████████████▊                                                                                                                           | 21/100 [00:38<02:38,  2.01s/it] 22%|██████████████████████████████████▎                                                                                                                         | 22/100 [00:38<02:02,  1.57s/it] 23%|███████████████████████████████████▉                                                                                                                        | 23/100 [00:39<01:33,  1.22s/it] 24%|█████████████████████████████████████▍                                                                                                                      | 24/100 [00:40<01:21,  1.08s/it] 25%|███████████████████████████████████████                                                                                                                     | 25/100 [00:41<01:25,  1.14s/it] 26%|████████████████████████████████████████▌                                                                                                                   | 26/100 [00:43<01:46,  1.44s/it] 27%|██████████████████████████████████████████                                                                                                                  | 27/100 [00:43<01:24,  1.16s/it] 28%|███████████████████████████████████████████▋                                                                                                                | 28/100 [00:47<02:19,  1.94s/it] 29%|█████████████████████████████████████████████▏                                                                                                              | 29/100 [00:48<01:46,  1.50s/it] 30%|██████████████████████████████████████████████▊                                                                                                             | 30/100 [00:50<02:03,  1.77s/it] 31%|████████████████████████████████████████████████▎                                                                                                           | 31/100 [00:51<01:39,  1.43s/it] 32%|█████████████████████████████████████████████████▉                                                                                                          | 32/100 [00:52<01:37,  1.44s/it] 33%|███████████████████████████████████████████████████▍                                                                                                        | 33/100 [00:53<01:16,  1.14s/it] 34%|█████████████████████████████████████████████████████                                                                                                       | 34/100 [00:53<01:05,  1.00it/s] 35%|██████████████████████████████████████████████████████▌                                                                                                     | 35/100 [00:54<00:55,  1.17it/s] 36%|████████████████████████████████████████████████████████▏                                                                                                   | 36/100 [00:54<00:50,  1.27it/s] 37%|█████████████████████████████████████████████████████████▋                                                                                                  | 37/100 [00:57<01:21,  1.29s/it] 38%|███████████████████████████████████████████████████████████▎                                                                                                | 38/100 [00:58<01:11,  1.16s/it] 39%|████████████████████████████████████████████████████████████▊                                                                                               | 39/100 [00:58<00:59,  1.02it/s] 40%|██████████████████████████████████████████████████████████████▍                                                                                             | 40/100 [01:02<01:47,  1.80s/it] 41%|███████████████████████████████████████████████████████████████▉                                                                                            | 41/100 [01:04<01:50,  1.88s/it] 42%|█████████████████████████████████████████████████████████████████▌                                                                                          | 42/100 [01:05<01:32,  1.60s/it] 43%|███████████████████████████████████████████████████████████████████                                                                                         | 43/100 [01:06<01:24,  1.49s/it] 45%|██████████████████████████████████████████████████████████████████████▏                                                                                     | 45/100 [01:06<00:45,  1.21it/s] 46%|███████████████████████████████████████████████████████████████████████▊                                                                                    | 46/100 [01:10<01:19,  1.47s/it] 47%|█████████████████████████████████████████████████████████████████████████▎                                                                                  | 47/100 [01:11<01:13,  1.38s/it] 48%|██████████████████████████████████████████████████████████████████████████▉                                                                                 | 48/100 [01:12<01:02,  1.21s/it] 49%|████████████████████████████████████████████████████████████████████████████▍                                                                               | 49/100 [01:13<00:56,  1.11s/it] 50%|██████████████████████████████████████████████████████████████████████████████                                                                              | 50/100 [01:16<01:25,  1.70s/it] 51%|███████████████████████████████████████████████████████████████████████████████▌                                                                            | 51/100 [01:16<01:09,  1.43s/it] 52%|█████████████████████████████████████████████████████████████████████████████████                                                                           | 52/100 [01:18<01:09,  1.45s/it] 53%|██████████████████████████████████████████████████████████████████████████████████▋                                                                         | 53/100 [01:19<01:07,  1.43s/it] 54%|████████████████████████████████████████████████████████████████████████████████████▏                                                                       | 54/100 [01:20<00:59,  1.29s/it] 55%|█████████████████████████████████████████████████████████████████████████████████████▊                                                                      | 55/100 [01:23<01:16,  1.70s/it] 56%|███████████████████████████████████████████████████████████████████████████████████████▎                                                                    | 56/100 [01:24<01:08,  1.56s/it] 60%|█████████████████████████████████████████████████████████████████████████████████████████████▌                                                              | 60/100 [01:27<00:39,  1.00it/s] 61%|███████████████████████████████████████████████████████████████████████████████████████████████▏                                                            | 61/100 [01:29<00:48,  1.24s/it] 62%|████████████████████████████████████████████████████████████████████████████████████████████████▋                                                           | 62/100 [01:32<00:56,  1.48s/it] 63%|██████████████████████████████████████████████████████████████████████████████████████████████████▎                                                         | 63/100 [01:32<00:48,  1.31s/it] 64%|███████████████████████████████████████████████████████████████████████████████████████████████████▊                                                        | 64/100 [01:37<01:15,  2.10s/it] 65%|█████████████████████████████████████████████████████████████████████████████████████████████████████▍                                                      | 65/100 [01:38<01:00,  1.74s/it] 66%|██████████████████████████████████████████████████████████████████████████████████████████████████████▉                                                     | 66/100 [01:38<00:48,  1.42s/it] 67%|████████████████████████████████████████████████████████████████████████████████████████████████████████▌                                                   | 67/100 [01:39<00:46,  1.41s/it] 68%|██████████████████████████████████████████████████████████████████████████████████████████████████████████                                                  | 68/100 [01:40<00:37,  1.16s/it] 69%|███████████████████████████████████████████████████████████████████████████████████████████████████████████▋                                                | 69/100 [01:41<00:33,  1.07s/it] 70%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████▏                                              | 70/100 [01:42<00:35,  1.20s/it] 71%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████▊                                             | 71/100 [01:45<00:45,  1.57s/it] 73%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████▉                                          | 73/100 [01:49<00:46,  1.73s/it] 74%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████▍                                        | 74/100 [01:49<00:39,  1.51s/it] 75%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████                                       | 75/100 [01:51<00:37,  1.50s/it] 76%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▌                                     | 76/100 [01:53<00:37,  1.58s/it] 77%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████                                    | 77/100 [01:54<00:31,  1.35s/it] 78%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▋                                  | 78/100 [01:54<00:25,  1.15s/it] 79%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▏                                | 79/100 [01:56<00:25,  1.21s/it] 80%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▊                               | 80/100 [01:56<00:22,  1.12s/it] 81%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▎                             | 81/100 [01:58<00:21,  1.11s/it] 82%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▉                            | 82/100 [01:58<00:17,  1.03it/s] 83%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▍                          | 83/100 [02:00<00:22,  1.35s/it] 84%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████                         | 84/100 [02:04<00:34,  2.16s/it] 85%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▌                       | 85/100 [02:05<00:26,  1.76s/it] 86%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▏                     | 86/100 [02:08<00:27,  2.00s/it] 87%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▋                    | 87/100 [02:09<00:24,  1.86s/it] 89%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▊                 | 89/100 [02:10<00:12,  1.10s/it] 90%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▍               | 90/100 [02:11<00:12,  1.23s/it] 91%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▉              | 91/100 [02:12<00:09,  1.07s/it] 92%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▌            | 92/100 [02:15<00:13,  1.66s/it] 93%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████           | 93/100 [02:16<00:09,  1.39s/it] 94%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▋         | 94/100 [02:17<00:07,  1.18s/it] 95%|████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▏       | 95/100 [02:17<00:05,  1.04s/it] 96%|█████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▊      | 96/100 [02:19<00:05,  1.30s/it] 97%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▎    | 97/100 [02:19<00:02,  1.03it/s] 99%|██████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████▍ | 99/100 [02:20<00:00,  1.62it/s]100%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 100/100 [02:20<00:00,  1.74it/s]100%|███████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████████| 100/100 [02:20<00:00,  1.41s/it]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     100       
Failed requests:                         0         
Maximum request concurrency:             10        
Benchmark duration (s):                  140.81    
Total input tokens:                      101603    
Total generated tokens:                  3212      
Request throughput (req/s):              0.71      
Output token throughput (tok/s):         22.81     
Peak output token throughput (tok/s):    116.00    
Peak concurrent requests:                14.00     
Total Token throughput (tok/s):          744.40    
---------------Time to First Token----------------
Mean TTFT (ms):                          577.98    
Median TTFT (ms):                        447.47    
P99 TTFT (ms):                           2238.03   
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          459.91    
Median TPOT (ms):                        438.73    
P99 TPOT (ms):                           732.70    
---------------Inter-token Latency----------------
Mean ITL (ms):                           124.75    
Median ITL (ms):                         102.89    
P99 ITL (ms):                            505.02    
==================================================

Script done on 2026-01-30 01:28:32+00:00 [COMMAND_EXIT_CODE="0"]
CSV saved to: ./benchmark_results/NVIDIA_GB10/vLLM_NVIDIA_GB10_gpt_oss_120b_text_only_samples_100_20260130_012546.csv

Completed: Fri Jan 30 01:28:32 AM UTC 2026


##############################################################
# vLLM TEXT-ONLY BENCHMARK COMPLETE
##############################################################
Results saved to: ./benchmark_results/NVIDIA_GB10/vLLM_NVIDIA_GB10_gpt_oss_120b_text_only_20260130_012546.txt